Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: Example 1. ingres_connect() example
pt_br: Exemplo 1. ingres_connect() example

source: Example 2. ingres_connect() example using default link
pt_br: Exemplo 2. ingres_connect() example using default link

source: Example 1. ingres_fetch_array() example
pt_br: Exemplo 1. ingres_fetch_array() example

source: Example 1. ingres_fetch_object() example
pt_br: Exemplo 1. ingres_fetch_object() example

source: Example 1. ingres_fetch_row() example
pt_br: Exemplo 1. ingres_fetch_row() example

source: Example 1. ingres_query() example
pt_br: Exemplo 1. ingres_query() example

source: Sets the value of the given configuration option.
pt_br: Description

source: Example 1. ip2long() Example
pt_br: Exemplo 1. ip2long() Example

source: Example 1. ircg_fetch_error_msg() example
pt_br: Exemplo 1. ircg_fetch_error_msg() example

source: Encodes a HTML string html_string for output.
pt_br: Description

source: Check for the existence of the format message set name.
pt_br: Description

source: This function returns TRUE if the object is of this class or has this class as one of its parents, FALSE otherwise.
pt_br: Esta função retorna TRUE se o objeto é desta classe ou tem esta classe como uma de suas classes pai, caso contrário retorna FALSE.

source: See also get_class(), get_parent_class(), and is_subclass_of().
pt_br: Veja também get_class(), get_parent_class(), e is_subclass_of().

source: Returns TRUE if var is an array, FALSE otherwise.
pt_br: Description

source: Returns TRUE if the var parameter is a boolean.
pt_br: Description

source: Returns TRUE if the filename exists and is a directory.
pt_br: Descrição

source: If filename is a relative filename, it will be checked relative to the current working directory.
pt_br: Se filename for um caminho relativo, o mesmo será checado relativo ao diretório atual.

source: See also chdir(), dir, opendir(), is_file() and is_link().
pt_br: Veja também chdir(), dir, opendir(), is_file() and is_link().

source: This function is an alias of is_float().
pt_br: is_double - - Alias of is_float()

source: Returns TRUE if the filename exists and is executable.
pt_br: Descrição

source: This function is not available on Win32.
pt_br: Esta função não está disponível no Win32.

source: See also is_file() and is_link().
pt_br: Veja também is_file() e is_link().

source: Returns TRUE if the filename exists and is a regular file.
pt_br: Retorna TRUE se o nome do nomedoarquivo existe e é um arquivo comum.

source: See also is_dir() and is_link().
pt_br: Veja também is_dir() e is_link().

source: Returns TRUE if val is a legal finite number within the allowed range for a PHP float on this platform.
pt_br: Retorna TRUE se val é número finito legal dentro dos limites permitidos para um número float PHP nesta plataforma.

source: Returns TRUE if val is infinite (positive or negative), like the result of log(0) or any value too big to fit into a float on this platform.
pt_br: Retorna TRUE se val é infinito (positivo ou negativo), como por exemplo o resultado de log(0) ou qualquer outro valor muito grande para caber num float desta plataforma.

source: This function is an alias of is_int().
pt_br: is_integer - - Alias of is_int()

source: Returns TRUE if the filename exists and is a symbolic link.
pt_br: Retorna TRUE se o nomedoarquivo existe e é um link simbólico (symbolic link).

source: See also is_dir(), is_file(), and readlink().
pt_br: Veja também is_dir(), is_file() e readlink().

source: Returns TRUE if val is' not a number', like the result of acos(1.01).
pt_br: Retona TRUE se val 'não for um número', como o resultado de acos(1.01).

source: Returns TRUE if var is null, FALSE otherwise.
pt_br: Description

source: Returns TRUE if var is an object, FALSE otherwise.
pt_br: Description

source: Returns TRUE if the filename exists and is readable.
pt_br: Descrição

source: Keep in mind that PHP may be accessing the file as the user id that the web server runs as (often'nobody').
pt_br: Lembre-se que o PHP deve estar acessando o arquivo como o mesmo usuário que o servidor de web roda (frequentemente 'nobody').

source: Safe mode limitations are not taken into account.
pt_br: Limitações do safemode não são levadas em consideração.

source: See also is_writable().
pt_br: Veja também is_writable().

source: Returns TRUE if var exists; FALSE otherwise.
pt_br: Description

source: Returns TRUE if var is a string, FALSE otherwise.
pt_br: Description

source: This function returns TRUE if the object object, belongs to a class which is a subclass of class_name, FALSE otherwise.
pt_br: Esta função retorna TRUE se o objeto object, pertence a uma classe que é uma sub-classe de class_name, caso contrário retorna FALSE.

source: See also get_class(), get_parent_class() and is_a().
pt_br: Veja também get_class(), get_parent_class() e is_a().

source: (PHP 3 = 3.0.17, PHP 4 = 4.0.3)
pt_br: is_uploaded_file

source: Returns TRUE if the file named by filename was uploaded via HTTP POST.
pt_br: Descrição

source: This is useful to help ensure that a malicious user hasn 't tried to trick the script into working on files upon which it should not be working--for instance, / etc / passwd.
pt_br: Isto é útil para ter certeza que um usuário malicioso, não está tentando confundir o script em trabalhar em arquivos que não deve estar trabalhando -- - por exemplo, / etc / passwd.

source: This sort of check is especially important if there is any chance that anything done with uploaded files could reveal their contents to the user, or even to other users on the same system.
pt_br: Este tipo de confirmação é importante principalmente se existe alguma chance que qualquer coisa feita com os arquivos carregados poderiam revelar o seu conteúdo para o usuário, ou mesmo para outros usuários no mesmo sistema.

source: is_uploaded_file() is available only in versions of PHP 3 after PHP 3.0.16, and in versions of PHP 4 after 4.0.2.
pt_br: is_uploaded_file() está disponível somente em versões do PHP 3 depois da 3.0.16 e em versões do PHP 4 posteriores a 4.0.2.

source: If you are stuck using an earlier version, you can use the following function to help protect yourself:
pt_br: Se você ainda está utilizando uma versão anterior, você pode utilizar o seguinte código para se proteger:

source: The following example will not work in versions of PHP 4 after 4.0.2.
pt_br: O exemplo seguinte não funcionará em versões do PHP posteriores a 4.0.2.

source: It depends on internal functionality of PHP which changed after that version.
pt_br: Isto depende de uma funcionalidade interna do PHP que mudou depois dessa versão.

source: ?php / * Userland test for uploaded file. * / function is_uploaded_file( $filename) {if (!$tmp_file = get_cfg_var('upload_tmp_dir')) {$tmp_file = dirname(tempnam('', ''));} $tmp_file .= '/'. basename($filename); / * User might have trailing slash in php.ini... * / return (ereg_replace(' / +', '/', $tmp_file) == $filename);} / * This is how to use it, since you also don't have * move_uploaded_file() in these older versions: * / if (is_uploaded_file($HTTP_POST_FILES['userfile'])) {copy($HTTP_POST_FILES['userfile'], "/ place / to / put / uploaded / file");} else {echo "Possible file upload attack: filename '$HTTP_POST_FILES[userfile]' .";}?
pt_br: ?php / * Teste de arquivo carregado pelo usuário * / function is_uploaded_file( $filename) {if (!$tmp_file = get_cfg_var('upload_tmp_dir')) {$tmp_file = dirname(tempnam('', ''));} $tmp_file .= '/'. basename($filename); / * Pode haver uma barra no final do php.ini... * / return (ereg_replace(' / +', '/', $tmp_file) == $filename);} / * Utilize isto se por acaso você não tiver * move_uploaded_file() em versões antigas: * / if (is_uploaded_file($HTTP_POST_FILES['userfile'])) {copy($HTTP_POST_FILES['userfile'], "/ place / to / put / uploaded / file");} else {echo "Possível ataque de carregamento de arquivo: filename '$HTTP_POST_FILES[userfile]' .";}?

source: See also move_uploaded_file(), and the section Handling file uploads for a simple usage example.
pt_br: Veja também move_uploaded_file() e a seção Manipulando upload de arquivos para um exemplo de utilização desta função.

source: Returns TRUE if the filename exists and is writable.
pt_br: Retorna TRUE se o nomedoarquivo existe e pode ser escrito para.

source: The filename argument may be a directory name allowing you to check if a directory is writeable.
pt_br: O argumento nomedoarquivo pode ser um nome de diretório, deixando você saber se o diretório pode ser escrito para (writeable).

source: See also is_readable().
pt_br: Veja também is_readable().

source: This is an alias for is_writable()
pt_br: Esta é uma função sinônima (alias) para is_writable()

source: Returns the day of the week.
pt_br: Description

source: join() is an alias to implode(), and is identical in every way.
pt_br: join() é um alias para implode(), e é indêntica em tudo.

source: See also explode(), implode(), and split().
pt_br: Veja também explode(), implode(), e split().

source: Valid Range for Julian Calendar 4713 B.C. to 9999 A.D.
pt_br: Description

source: Caution
pt_br: Cuidado

source: key() returns the index element of the current array position.
pt_br: key() retorna a chave da posição corrente de um array.

source: See also current() and next().
pt_br: Veja também current() e next().

source: Sorts an array by key in reverse order, maintaining key to data correlations.
pt_br: Ordena um array pelas chaves em ordem descrescente, mantendo a correlação entre entre as chaves e os valores.

source: This is useful mainly for associative arrays.
pt_br: Essa função é bastante útil em arrays associativos.

source: Example 1. krsort() example
pt_br: Exemplo de krsort()

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); krsort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
pt_br: $frutas = array ("d "= "limao", "a" = "laranja", "b "= "banana", "c" = "melancia"); krsort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "$chave = $valor\n";}

source: d = lemon c = apple b = banana a = orange
pt_br: d = limao c = melancia b = banana a = laranja

source: See also asort(), arsort(), ksort(), sort(), natsort(), and rsort().
pt_br: Veja também asort(), arsort(), ksort() sort(), natsort() e rsort().

source: Sorts an array by key, maintaining key to data correlations.
pt_br: Ordena um array pelas chaves, mantendo a correlação entre as chaves e os valores.

source: Example 1. ksort() example
pt_br: Exemplo de ksort()

source: $fruits = array ("d"= "lemon", "a"= "orange", "b"= "banana", "c"= "apple"); ksort ($fruits); reset ($fruits); while (list ($key, $val) = each ($fruits)) {echo "$key = $val\n";}
pt_br: $frutas = array ("d "= "limao", "a" = "laranja", "b "= "banana", "c" = "melancia"); ksort ($frutas); reset ($frutas); while (list ($chave, $valor) = each ($frutas)) {echo "$chave = $valor\n";}

source: a = orange b = banana c = apple d = lemon
pt_br: a = laranja b = banana c = melancia d = limao

source: See also asort(), arsort(), krsort(), uksort(), sort(), natsort(), and rsort().
pt_br: Veja também asort(), arsort(), krsort(), uksort(), sort(), natsort() e rsort().

source: The second parameter was added in PHP 4.
pt_br: O segundo parâmetro foi adicionado a partir do PHP 4.

source: lcg_value() returns a pseudo random number in the range of (0, 1).
pt_br: lcg_value() retorna um pseudo número aleatório nos limites de (0, 1).

source: The function combines two CGs with periods of 2^31 - 85 and 2^31 - 249.
pt_br: A função combina duas congruências geradas, com períodos de 2^31 - 85 e 2^31 - 249.

source: The period of this function is equal to the product of both primes.
pt_br: O período desta função é igual ao produto de ambos os primos.

source: The ldap_add() function is used to add entries in the LDAP directory.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: ldap_close() closes the link to the LDAP server that's associated with the specified link_identifier.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Returns TRUE if value matches otherwise returns FALSE.
pt_br: Description

source: Returns number of entries in the result or FALSE on error.
pt_br: Description

source: ldap_delete() function delete a particular entry in LDAP directory specified by dn.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Returns string error message.
pt_br: Description

source: Returns the first attribute in the entry on success and FALSE on error.
pt_br: Description

source: ldap_free_result() frees up the memory allocated internally to store the result and pointed by the result_identifier.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Returns the DN of the result entry and FALSE on error.
pt_br: Description

source: Sets retval to the value of the specified option.
pt_br: Description

source: The parameter option The parameter option can be one of:
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Returns an array of values for the attribute on success and FALSE on error.
pt_br: Description

source: Returns a search result identifier or FALSE on error.
pt_br: Description

source: This function adds attribute( s) to the specified dn.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: This function removes attribute( s) from the specified dn.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: ldap_modify() function is used to modify the existing entries in the LDAP directory.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: This function replaces attribute( s) from the specified dn.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: The entry specified by dn is renamed / moved.
pt_br: Description

source: Sets the value of the specified option to be newval.
pt_br: Description

source: ldap_unbind() function unbinds from the LDAP directory.
pt_br: Retorna TRUE em caso de sucesso ou FALSE em falhas.

source: Mail functions
pt_br: Funções de E-Mail

source: This function returns the Levenshtein-Distance between the two argument strings or -1, if one of the argument strings is longer than the limit of 255 characters (255 should be more than enough for name or dictionary comparison, and nobody serious would be doing genetic analysis with PHP).
pt_br: Retorna a Levenshtein-Distance entre duas strings argumentos ou -1, se nenhuma das strings argumentos é mais longa que o o limite de 255 caracteres (255 seria mais do que o bastante para o nome ou comparação de dicionário, e ninguém sério estaria fazendo análises genéticas com PHP).

source: The Levenshtein distance is defined as the minimal number of characters you have to replace, insert or delete to transform str1 into str2.
pt_br: A distância Levenshtein é definida como o número mínimo de caracteres que você tem para substituir, inserir ou apagar para transformar str1 dentro de str2.

source: The complexity of the algorithm is O( m*n), where n and m are the length of str1 and str2 (rather good when compared to similar_text(), which is O(max(n,m)**3), but still expensive).
pt_br: A complexidade do algoritmo é O( m*n), onde n e m são o comprimento da str1 e str2 (rather good when compared to similar_text(), which is O(max(n,m)**3), but still expensive).

source: In its simplest form the function will take only the two strings as parameter and will calculate just the number of insert, replace and delete operations needed to transform str1 into str2.
pt_br: Na sua forma mais simples a função pegará apenas as duas strings como parâmetros e calculará apenas o número de operações de inserção, substituição e deletação necessárias para transformar str1 em str2.

source: A second variant will take three additional parameters that define the cost of insert, replace and delete operations.
pt_br: Uma segunda variante pegará três parâmetros adicionais que definem o custo das operações de inserção, substituição e deletação.

source: This is more general and adaptive than variant one, but not as efficient.
pt_br: Esta é a mais geral e adapatável do que a variante um, mas não tão eficiente.

source: The third variant (which is not implemented yet) will be the most general and adaptive, but also the slowest alternative.
pt_br: A terceira variante (que ainda não é implementada) será a mais geral e adaptável, mas também a alternativa mais lenta.

source: It will call a user-supplied function that will determine the cost for every possible operation.
pt_br: Ela chamará uma função de usuário fornecida que determinará o custo para cada possível operação.

source: The user-supplied function will be called with the following arguments:
pt_br: A função de usuário fornecida( The user-supplied function) será chamada com os seguintes argumentos:

source: operation to apply: 'I', 'R' or'D '
pt_br: operation to apply: 'I', 'R' ou 'D '

source: See also soundex(), similar_text(), and metaphone().
pt_br: Veja também soundex(), similar_text(), e metaphone().

source: link() creates a hard link.
pt_br: Descrição

source: See also the symlink() to create soft links, and readlink() along with linkinfo().
pt_br: Veja também symlink() para criar soft links, e readlink() assim como linkinfo().

source: linkinfo() returns the st_dev field of the UNIX C stat structure returned by the lstat system call.
pt_br: linkinfo() retorna o campo st_dev da structure em C do UNIX retornado pela chamada do sistema (system call) lstat.

source: This function is used to verify if a link (pointed to by path) really exists (using the same method as the S_ISLNK macro defined in stat.h).
pt_br: Esta função é usada para verificar se um link (apontado por path) realmente existe (usando o mesmo metodo que a macro S_ISLNK definida em stat.h).

source: Returns 0 or FALSE in case of error.
pt_br: Retorna 0 ou FALSE em caso de erro.

source: See also symlink(), link(), and readlink().
pt_br: Veja também symlink(), link(), e readlink().

source: Like array(), this is not really a function, but a language construct. list() is used to assign a list of variables in one operation.
pt_br: Assim como array(), não é exatamente uma função, e sim uma construção da própria linguagem. list() é usada para criar uma lista de variáveis em apenas um operação.

source: Example 1. list() examples
pt_br: Exemplo de list()

source: ?php $info = array( 'coffee', 'brown', 'caffeine'); / / Listing all the variables list($drink, $color, $power) = $info; print "$drink is $color and $power makes it special.\n"; / / Listing some of them list($drink,, $power) = $info; print "$drink has $power.\n"; / / Or let's skip to only the third one list (,, $power) = $info; print "I need $power!\n";?
pt_br: ?php $info = array( 'Café', 'marrom', 'cafeína'); / / Listando todas as variáveis list($bebida, $cor, $substancia) = $info; print "$bebida is $cor e $substancia a faz especial.\n"; / / Listando apenas alguns deles list($bebida,, $substanciar) = $info; print "$bebida tem $substancia.\n"; / / Ou ignoramos os primeiros valores para conseguir apenas o último list (,, $substancia) = $info; print "I need $substancia!\n";?

source: An example use of list()
pt_br: Exemplo de list()

source: table tr th Employee name / th th Salary / th / tr ?php $result = mysql_query ("SELECT id, name, salary FROM employees",$conn); while (list ($id, $name, $salary) = mysql_fetch_row ($result)) {print ("tr \n"." td a href=\"info.php?id=$id\ "$name / a / td \n"." td $salary / td \n". "/ tr \n");}? / table
pt_br: table tr th Lista de empregados / th th Salário / th / tr ?php $result = mysql_query ("SELECT id, nome, salario FROM empregados", $conn); while (list ($id, $nome, $salario) = mysql_fetch_row ($result)) {print ("tr \n"." td a href=\"info.php?id=$id\ "$nome / a / td \n"." td $salario / td \n". "/ tr \n");}? / table

source: list() assigns the values starting with the right-most parameter.
pt_br: A função list() assinala os valores começando pelos parâmetros da direita.

source: If you are using plain variables, you don 't have to worry about this.
pt_br: Se você está usando variáveis normais, então não precisa se preocupar com esse detalhe.

source: But if you are using arrays with indices you usually expect the order of the indices in the array the same you wrote in the list() from left to right; which it isn't.
pt_br: Mas se você está usando arrays com índices você normalmente iria esperar que a ordem dos índices no array fosse da esquerda para a direita, mas não é isso que acontece.

source: It 's assigned in the reverse order.
pt_br: O índice é criado na ordem reversa.

source: Example 3.
pt_br: Exemplo 3.

source: Using list() with array indices
pt_br: Usando list() com índices de array

source: ?php $info = array( 'coffee', 'brown', 'caffeine'); list($a[0], $a[1], $a[2]) = $info; var_dump($a);?
pt_br: ?php $info = array( 'café', 'marrom', 'cafeína'); list($a[0], $a[1], $a[2]) = $info; var_dump($a);?

source: array( 3) {[2]= string(8) "caffeine "[1]= string(5) "brown" [0]= string(6) "coffee "}
pt_br: array( 3) {[2]= string(8) "cafeína "[1]= string(5) "marrom" [0]= string(6) "café "}

source: See also each(), array() and extract().
pt_br: Veja também each(), array() e extract().

source: Returns an associative array containing localized numeric and monetary formatting information.
pt_br: Retorna uma matriz associativa contendo numérico localizado e informação de formatação monetária.

source: localeconv() returns data based upon the current locale as set by setlocale().
pt_br: localeconv() retorna dados baseados na localidade corrente definida por setlocale().

source: The associative array that is returned contains the following fields:
pt_br: A matriz associativa que é retornada contém os seguintes campos:

source: Decimal point character
pt_br: Caracter de ponto decimal

source: Array containing numeric groupings
pt_br: Matriz contendo agrupamentos numéricos

source: Local currency symbol (i.e. $)
pt_br: Simbolo da moeda local symbol (i.e. $)

source: Monetary decimal point character
pt_br: Caractere monetário de ponto decimal

source: Monetary thousands separator
pt_br: Separador monetário de mil

source: Array containing monetary groupings
pt_br: Matriz contendo agrupamentos monetários

source: Sign for positive values
pt_br: Sinal para valores positivos

source: Sign for negative values
pt_br: Sinal para valores negativos

source: International fractional digits
pt_br: Dígitos de fração Internacionais

source: Local fractional digits
pt_br: Dígitos de fração locais

source: TRUE if currency_symbol precedes a positive value, FALSE if it succeeds one
pt_br: TRUE Se o simbolo da moeda precede um valor positivo, FALSE se eles sucede um.

source: TRUE if a space separates currency_symbol from a positive value, FALSE otherwise
pt_br: TRUE Se um espaço separa o simbolo da moeda de um valor positivo, FALSE caso contrário

source: TRUE if currency_symbol precedes a negative value, FALSE if it succeeds one
pt_br: TRUE Se o simbolo de moeda precede um valor negativo, FALSE se ele sucede

source: TRUE if a space separates currency_symbol from a negative value, FALSE otherwise
pt_br: TRUE se um espaço separa o simbolo da moeda de um valor negativo, FALSE caso contrário

source: Parentheses surround the quantity and currency_symbol
pt_br: Parênteses na quantidade e simbolo da moeda

source: The sign string precedes the quantity and currency_symbol
pt_br: A string sinal precede a quantidade e o simbolo da moeda

source: The sign string succeeds the quantity and currency_symbol
pt_br: A string sinal sucede a quantidade e o simbolo da moeda

source: The sign string immediately precedes the currency_symbol
pt_br: A string sinal precede imediatamente o simbolo da moeda
